Adyen.Test/mocks/transferwebhooks/balancePlatform.transfer.updated.directDebit.booked.json

{
  "type": "balancePlatform.transfer.updated",
  "environment": "test",
  "timestamp": "2024-08-28T13:27:05+02:00",
  "data": {
    "accountHolder": {
      "description": "Your description of the account holder",
      "id": "AH00000000000000000000002",
      "reference": "Your reference for the account holder"
    },
    "amount": {
      "currency": "EUR",
      "value": 1000
    },
    "balanceAccount": {
      "description": "Your description of the target balance account",
      "id": "BA00000000000000000000002"
    },
    "balancePlatform": "YOUR_BALANCE_PLATFORM",
    "balances": [
      {
        "balance": -1000,
        "currency": "EUR",
        "received": 0,
        "reserved": 0
      }
    ],
    "category": "bank",
    "categoryData": {
      "type": "bank"
    },
    "counterparty": {
      "bankAccount": {
        "accountHolder": {
          "fullName": "John Smith",
          "type": "unknown"
        },
        "accountIdentification": {
          "iban": "FR0000000000000000000000117",
          "type": "iban"
        }
      }
    },
    "creationDate": "2024-08-28T13:30:05+02:00",
    "directDebitInformation": {
      "dateOfSignature": "2023-01-01T01:00:00+01:00",
      "dueDate": "2024-08-23T02:00:00+02:00",
      "mandateId": "EBAClearing-MANDAT001",
      "sequenceType": "FRST"
    },
    "direction": "incoming",
    "events": [
      {
        "bookingDate": "2024-08-28T13:30:18+02:00",
        "id": "JDRF00000000000000000000000001",
        "mutations": [
          {
            "currency": "EUR",
            "received": -1000
          }
        ],
        "status": "received",
        "type": "accounting"
      },
      {
        "bookingDate": "2024-08-28T13:30:18+02:00",
        "id": "JDRF00000000000000000000000002",
        "mutations": [
          {
            "currency": "EUR",
            "received": 1000,
            "reserved": -1000
          }
        ],
        "status": "authorised",
        "type": "accounting"
      },
      {
        "bookingDate": "2024-08-28T13:30:18+02:00",
        "id": "JDRF00000000000000000000000003",
        "mutations": [
          {
            "balance": -1000,
            "currency": "EUR",
            "received": 0,
            "reserved": 1000
          }
        ],
        "status": "booked",
        "transactionId": "JDRF00000000000000000000000MEUR",
        "type": "accounting",
        "valueDate": "2024-08-28T14:00:00+02:00"
      }
    ],
    "id": "2WT1N05XXY7P9XH9",
    "reason": "approved",
    "reference": "Your reference for the transfer",
    "sequenceNumber": 3,
    "status": "booked",
    "type": "bankDirectDebit"
  }
}
