Adyen.Test/mocks/transferwebhooks/balancePlatform.transfer.updated.tracking.confirmation.json

{
  "type": "balancePlatform.transfer.updated",
  "environment": "test",
  "timestamp": "2023-02-28T14:15:00+02:00",
  "data": {
    "accountHolder": {
      "description": "Your description of the account holder",
      "id": "AH00000000000000000000001",
      "reference": "Your reference for the account holder"
    },
    "amount": {
      "currency": "EUR",
      "value": 10000
    },
    "balanceAccount": {
      "description": "Your description of the balance account",
      "id": "BA00000000000000000000001",
      "reference": "Your reference for the balance account"
    },
    "balancePlatform": "YOUR_BALANCE_PLATFORM",
    "balances": [
      {
        "balance": -10000,
        "currency": "EUR",
        "received": 0,
        "reserved": 0
      }
    ],
    "category": "bank",
    "categoryData": {
      "priority": "regular",
      "type": "bank"
    },
    "counterparty": {
      "transferInstrumentId": "SE00000000000000000000001"
    },
    "creationDate": "2023-02-28T13:30:05+02:00",
    "direction": "outgoing",
    "events": [
      {
        "bookingDate": "2023-02-28T14:15:00+02:00",
        "id": "EVJN00000000000000000000000004",
        "status": "credited",
        "trackingData": {
          "status": "credited",
          "type": "confirmation"
        },
        "type": "tracking",
        "updateDate": "2023-02-28T14:15:00+02:00"
      }
    ],
    "id": "6JKRLZ8LOT47J7RY",
    "reason": "approved",
    "reference": "Your reference for the transfer",
    "sequenceNumber": 4,
    "status": "booked",
    "type": "bankTransfer"
  }
}
